{
    "timestamp": "Jun 20, 2025 5:21 PM EST",
    "stats": {
        "input_words": 3198607,
        "output_words": 1780,
        "filings_processed": 22
    },
    "filings": [
        {
            "company_name": "CrowdStrike",
            "stock": "CRWD",
            "wiki_url": "https://en.wikipedia.org/wiki/CrowdStrike",
            "change_percent": 0,
            "price": 485.05,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T17:07:58-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1535527/000110465925061216/0001104659-25-061216-index.htm",
            "accession_number": "0001104659-25-061216",
            "summary_points": [
                "1. At the June 18, 2025 Annual Meeting, CrowdStrike Holdings, Inc. stockholders elected three Class III directors and ratified the selection of PricewaterhouseCoopers LLP as the independent registered public accounting firm for the fiscal year ending January 31, 2026.",
                "2.  Significant numbers of votes were withheld for the election of two of the three Class III directors (Cary J. Davis and Laura J. Schumacher), indicating some shareholder dissent.",
                "3.  There is no indication of any future impacts or risks mentioned within this section of the filing."
            ]
        },
        {
            "company_name": "IBM",
            "stock": "IBM",
            "wiki_url": "https://en.wikipedia.org/wiki/IBM",
            "change_percent": 0,
            "price": 283.23,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T17:00:06-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/51143/000095015725000533/0000950157-25-000533-index.htm",
            "accession_number": "0000950157-25-000533",
            "summary_points": [
                "1. IBM amended two credit agreements, extending the maturity of a $2.5 billion credit agreement to June 20, 2028, and a $7.5 billion credit agreement to June 22, 2030.",
                "2.  The amendments extend the maturity dates of IBM's credit agreements by several years.",
                "3.  The amendments' full details are available in Exhibits 10.1 and 10.2, but this filing does not specify any future impacts or risks associated with these changes."
            ]
        },
        {
            "company_name": "UnitedHealth Group",
            "stock": "UNH",
            "wiki_url": "https://en.wikipedia.org/wiki/UnitedHealth_Group",
            "change_percent": 0,
            "price": 307.29,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:44:03-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/731766/000119312525143717/0001193125-25-143717-index.htm",
            "accession_number": "0001193125-25-143717",
            "summary_points": [
                "1. On June 17, 2025, UnitedHealth Group Incorporated sold $3,000,000,000 in debt securities across four different notes, maturing between 2028 and 2055.",
                "2.  The sale resulted in net proceeds of $2,970,567,500 (99.02% of the total principal amount offered) to the issuer.",
                "3.  The offering is subject to various conditions precedent, including the filing of necessary documents and legal opinions, and the satisfaction of conditions related to material adverse changes in the company and the market."
            ]
        },
        {
            "company_name": "Delta Air Lines",
            "stock": "DAL",
            "wiki_url": "https://en.wikipedia.org/wiki/Delta_Air_Lines",
            "change_percent": 0,
            "price": 47.56,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:31:35-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/27904/000168316825004655/0001683168-25-004655-index.htm",
            "accession_number": "0001683168-25-004655",
            "summary_points": [
                "1. Delta Air Lines, Inc. shareholders approved an amendment and restatement of the Performance Compensation Plan on June 19, 2025, increasing the number of authorized shares by 9,600,000 and extending the expiration date to June 19, 2035.",
                "2.  At the 2025 Annual Meeting, shareholder votes on the election of directors showed significant opposition to certain nominees, with Sergio A. L. Rial receiving 43,243,991 votes against his election and David S. Taylor receiving 14,997,782 votes against his election.",
                "3. A shareholder proposal requesting the ability for shareholders to act by written consent was not approved at the 2025 Annual Meeting."
            ]
        },
        {
            "company_name": "Vulcan Materials Company",
            "stock": "VMC",
            "wiki_url": "https://en.wikipedia.org/wiki/Vulcan_Materials_Company",
            "change_percent": 0,
            "price": 258.09,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:30:39-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1396009/000114036125023183/0001140361-25-023183-index.htm",
            "accession_number": "0001140361-25-023183",
            "summary_points": [
                "1. On June 18, 2025, Vulcan Materials Company's Clear Creek Quarry in Charlotte, North Carolina received an imminent danger order from the Mine Safety and Health Administration (MSHA) due to unsafe working conditions involving miners shoveling material onto a moving conveyor;  corrective action was taken immediately, and no injuries occurred.",
                "2. The filing is an 8-K current report, indicating a significant event requiring immediate disclosure to the SEC.",
                "3.  This MSHA incident, while resolved, presents a future risk of further regulatory action and potential fines or penalties if similar safety violations occur."
            ]
        },
        {
            "company_name": "FirstEnergy",
            "stock": "FE",
            "wiki_url": "https://en.wikipedia.org/wiki/FirstEnergy",
            "change_percent": 0,
            "price": 39.74,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:23:39-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1031296/000103129625000030/0001031296-25-000030-index.htm",
            "accession_number": "0001031296-25-000030",
            "summary_points": [
                "1. On June 17, 2025, FirstEnergy Corp. amended its Long-term Incentive Compensation Program (LTIP) to replace the operating earnings per share (EPS) key performance indicator (KPI) with a Core EPS KPI for the 2023 and 2024 LTIP Awards,  affecting all eligible recipients, including named executive officers.",
                "2.  The change in the LTIP KPI from Operating EPS to Core EPS, effective January 1, 2025, aligns executive compensation with the company's shift to reporting Core EPS, a non-GAAP metric, instead of Operating EPS,  as announced earlier in 2025.",
                "3. The amended LTIP Awards now limit the maximum payout for the EPS KPI to 100% of target."
            ]
        },
        {
            "company_name": "Match Group",
            "stock": "MTCH",
            "wiki_url": "https://en.wikipedia.org/wiki/Match_Group",
            "change_percent": 0,
            "price": 30.31,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:17:36-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/891103/000089110325000084/0000891103-25-000084-index.htm",
            "accession_number": "0000891103-25-000084",
            "summary_points": [
                "1. Match Group, Inc. stockholders approved an amendment to the 2024 Stock and Annual Incentive Plan on June 18, 2025, increasing the number of shares available for issuance by 4,200,000 and extending the plan's term.",
                "2. At the 2025 Annual Meeting,  stockholders approved a declassification of the Board of Directors over a three-year period, effective June 18, 2025.",
                "3.  Darrell Cavens was appointed to the Match Group, Inc. Board of Directors and as Chair of the Audit Committee, effective June 18, 2025."
            ]
        },
        {
            "company_name": "Teradyne",
            "stock": "TER",
            "wiki_url": "https://en.wikipedia.org/wiki/Teradyne",
            "change_percent": 0,
            "price": 86.28,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:15:23-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/97210/000119312525143662/0001193125-25-143662-index.htm",
            "accession_number": "0001193125-25-143662",
            "summary_points": [
                "1. Teradyne, Inc. amended and restated its By-Laws on June 20, 2025, changing the director nomination and shareholder proposal notice windows from 60 and 90 days to 90 and 120 days before the annual meeting, respectively.",
                "2.  Shareholders wishing to nominate a director candidate or propose a matter at the 2026 annual meeting must submit written notice between January 9, 2026, and February 8, 2026.",
                "3. The amended By-Laws include updated procedures for shareholder nominations, proposals, and proxy access, clarifying plurality voting and chairperson authority."
            ]
        },
        {
            "company_name": "EOG Resources",
            "stock": "EOG",
            "wiki_url": "https://en.wikipedia.org/wiki/EOG_Resources",
            "change_percent": 0,
            "price": 123.8,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:07:31-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/821189/000119312525143645/0001193125-25-143645-index.htm",
            "accession_number": "0001193125-25-143645",
            "summary_points": [
                "1. On June 16, 2025, EOG Resources Inc. entered into an underwriting agreement to sell $3,500,000,000 aggregate principal amount of senior notes with varying maturity dates and interest rates, with the offering expected to close on July 1, 2025.",
                "2.  The sale of senior notes will raise $3,500,000,000 in aggregate principal amount.",
                "3. Some underwriters and their affiliates have existing and future commercial dealings with EOG, potentially creating conflicts of interest."
            ]
        },
        {
            "company_name": "Dollar Tree",
            "stock": "DLTR",
            "wiki_url": "https://en.wikipedia.org/wiki/Dollar_Tree",
            "change_percent": 0,
            "price": 97.51,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T16:02:56-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/935703/000093570325000033/0000935703-25-000033-index.htm",
            "accession_number": "0000935703-25-000033",
            "summary_points": [
                "1. Dollar Tree, Inc. reduced its board of directors from twelve to eleven members on June 19, 2025.",
                "2.  Significant shareholder dissent was expressed at the June 19, 2025 annual meeting, with votes against director nominees ranging from 170,864 to over 9 million.",
                "3.  A new Dollar Tree, Inc. Employee Stock Purchase Plan was approved by shareholders on June 19, 2025."
            ]
        },
        {
            "company_name": "Verizon",
            "stock": "VZ",
            "wiki_url": "https://en.wikipedia.org/wiki/Verizon",
            "change_percent": -0.45,
            "price": 41.66,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T13:40:58-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/732712/000119312525143513/0001193125-25-143513-index.htm",
            "accession_number": "0001193125-25-143513",
            "summary_points": [
                "1. Verizon completed exchange offers and cash offers for 10 series of notes on June 18, 2025, exchanging them for newly issued 5.401% Notes due 2037; the settlement date is expected to be June 25, 2025.",
                "2.  The highest principal amount tendered for exchange was $722,436,000 for the 4.329% Notes due 2028, while the highest amount tendered for purchase was $255,691,000 for the 2.100% Notes due 2028.",
                "3. The newly issued notes will not be registered under the Securities Act, meaning they cannot be offered or sold in the United States without registration or an exemption."
            ]
        },
        {
            "company_name": "Autodesk",
            "stock": "ADSK",
            "wiki_url": "https://en.wikipedia.org/wiki/Autodesk",
            "change_percent": -0.58,
            "price": 295.18,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T11:05:58-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/769397/000076939725000075/0000769397-25-000075-index.htm",
            "accession_number": "0000769397-25-000075",
            "summary_points": [
                "1. On June 18, 2025, Autodesk, Inc.'s Board of Directors appointed Jeff Epstein and A. Christine Simons to the Audit Committee, designating both as \"audit committee financial experts.\"",
                "2. At the June 18, 2025 Annual Meeting,  shareholder votes ranged from approximately 146 million to 171.5 million in favor of electing the ten individuals to the Board of Directors, with varying numbers of votes against and abstentions.",
                "3.  Autodesk, Inc.'s 2022 Equity Incentive Plan was amended and restated, effective June 18, 2025, increasing the maximum number of shares that may be issued under the plan to 43,750,000."
            ]
        },
        {
            "company_name": "Kroger",
            "stock": "KR",
            "wiki_url": "https://en.wikipedia.org/wiki/Kroger",
            "change_percent": -0.67,
            "price": 65.51,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T08:06:51-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/56873/000110465925060909/0001104659-25-060909-index.htm",
            "accession_number": "0001104659-25-060909",
            "summary_points": [
                "1. Kroger's first-quarter 2025 identical sales (excluding fuel and adjustments) increased 3.2% year-over-year, compared to a 0.5% increase in the first quarter of 2024.",
                "2.  Kroger raised its full-year 2025 identical sales (excluding fuel) guidance to a range of 2.25%–3.25%, as of June 20, 2025,  while other elements of their guidance remained unchanged.",
                "3. Kroger plans to close approximately 60 stores over the next 18 months,  resulting in a modest financial benefit that will be reinvested into the customer experience, and will not impact full-year guidance."
            ]
        },
        {
            "company_name": "Realty Income",
            "stock": "O",
            "wiki_url": "https://en.wikipedia.org/wiki/Realty_Income",
            "change_percent": 0.1,
            "price": 57.57,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T08:04:24-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/726728/000110465925060904/0001104659-25-060904-index.htm",
            "accession_number": "0001104659-25-060904",
            "summary_points": [
                "1. Realty Income Corporation closed an offering of €1.3 billion aggregate principal amount of 3.375% Notes due 2031 and 3.875% Notes due 2035 on June 20, 2025.",
                "2.  The June 20, 2025 offering of notes had an initial price to the public of 99.568% of the principal amount for the 2031 Notes and 99.552% for the 2035 Notes, with underwriting discounts and commissions of 0.650% of the principal amount for each.",
                "3. The offering's terms include covenants limiting total debt to 60% and secured debt to 40% of adjusted total assets, requiring a debt service coverage ratio of at least 1.5 to 1.0, and mandating the maintenance of total unencumbered assets at 150% of unsecured debt."
            ]
        },
        {
            "company_name": "Aflac",
            "stock": "AFL",
            "wiki_url": "https://en.wikipedia.org/wiki/Aflac",
            "change_percent": 0.43,
            "price": 102.55,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T08:01:13-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/4977/000000497725000128/0000004977-25-000128-index.htm",
            "accession_number": "0000004977-25-000128",
            "summary_points": [
                "1. On June 12, 2025, Aflac Inc. experienced unauthorized access to its network, containing the intrusion within hours; however, the full scope and impact remain unknown as of June 20, 2025.",
                "2.  Potentially impacted files contained sensitive customer, beneficiary, employee, and agent data, including claims information, health information, and social security numbers.",
                "3. Aflac Inc. anticipates notifying regulators and affected individuals, offering free credit monitoring and identity theft protection;  future impacts and risks include additional costs, legal issues, reputational damage, and potential regulatory actions."
            ]
        },
        {
            "company_name": "Darden Restaurants",
            "stock": "DRI",
            "wiki_url": "https://en.wikipedia.org/wiki/Darden_Restaurants",
            "change_percent": -0.84,
            "price": 222.78,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T07:04:25-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/940944/000094094425000028/0000940944-25-000028-index.htm",
            "accession_number": "0000940944-25-000028",
            "summary_points": [
                "1. As of June 20, 2025, Darden Restaurants, Inc. announced fiscal year 2025 fourth-quarter and full-year results, a 7.1% increase in its quarterly dividend, a new $1 billion share repurchase program, and a fiscal year 2026 outlook.",
                "2.  In the fourth quarter of fiscal year 2025, Darden's total sales increased by 10.6% year-over-year to $3.3 billion, while for the full fiscal year, total sales increased by 6.0% to $12.1 billion.",
                "3. For fiscal year 2026, Darden Restaurants projects total sales growth of 7% to 8%, with same-restaurant sales growth of 2% to 3.5%, and plans to open 60 to 65 new restaurants."
            ]
        },
        {
            "company_name": "CarMax",
            "stock": "KMX",
            "wiki_url": "https://en.wikipedia.org/wiki/CarMax",
            "change_percent": -0.14,
            "price": 64.34,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T06:58:22-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1170010/000117001025000080/0001170010-25-000080-index.htm",
            "accession_number": "0001170010-25-000080",
            "summary_points": [
                "1. CarMax reported a 42.3% year-over-year increase in net earnings per diluted share for the first quarter of fiscal year 2026, reaching $1.38, compared to $0.97 in the same period of 2025.",
                "2.  Retail used unit sales increased by 9.0% year-over-year, while comparable store used unit sales grew by 8.1% in the first quarter of fiscal year 2026.",
                "3.  CarMax Auto Finance (CAF) income decreased by 3.6% to $141.7 million in the first quarter of fiscal year 2026 due to increased loan loss provisions, despite growth in the net interest margin percentage."
            ]
        },
        {
            "company_name": "Accenture",
            "stock": "ACN",
            "wiki_url": "https://en.wikipedia.org/wiki/Accenture",
            "change_percent": -1.81,
            "price": 306.25,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T06:49:26-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1467373/000146737325000170/0001467373-25-000170-index.htm",
            "accession_number": "0001467373-25-000170",
            "summary_points": [
                "1. Accenture announced significant leadership changes effective September 1, 2025, including the creation of a new \"Reinvention Services\" business unit and several new executive appointments (CEO of the Americas, global COO, Chief Leadership and Human Resources Officer, Group Chief Executives for Consulting and Technology).",
                "2.  Three executives, Jack Azagury, Karthik Narain, and Angela Beatty, are leaving Accenture to pursue other opportunities.",
                "3. Accenture's new growth model, implemented September 1st 2025, aims to integrate services and accelerate Gen AI delivery, but faces inherent risks related to the successful execution and integration of these changes."
            ]
        },
        {
            "company_name": "Medtronic",
            "stock": "MDT",
            "wiki_url": "https://en.wikipedia.org/wiki/Medtronic",
            "change_percent": -0.56,
            "price": 85.73,
            "filing_type": "10-K",
            "filing_time": "2025-06-20T06:46:20-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1613103/000161310325000091/0001613103-25-000091-index.htm",
            "accession_number": "0001613103-25-000091",
            "summary_points": [
                "1.  No new information is provided in this section of the SEC filing."
            ]
        },
        {
            "company_name": "Accenture",
            "stock": "ACN",
            "wiki_url": "https://en.wikipedia.org/wiki/Accenture",
            "change_percent": -1.81,
            "price": 306.25,
            "filing_type": "10-Q",
            "filing_time": "2025-06-20T06:44:48-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1467373/000146737325000169/0001467373-25-000169-index.htm",
            "accession_number": "0001467373-25-000169",
            "summary_points": [
                "1. As of May 31, 2025, the company's total estimated fair value of senior notes was $4.9 billion.",
                "2.  The company had $7,753,888 in total borrowing facilities available as of May 31, 2025, compared to an unspecified amount on August 31, 2024.",
                "3.  Accenture Federal Services (AFS) is under investigation by the Department of Justice (DOJ) for potentially inaccurate submissions to the US government, which could result in various penalties, including contract termination and fines, with currently unquantifiable costs."
            ]
        },
        {
            "company_name": "Accenture",
            "stock": "ACN",
            "wiki_url": "https://en.wikipedia.org/wiki/Accenture",
            "change_percent": -1.81,
            "price": 306.25,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T06:43:34-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1467373/000146737325000168/0001467373-25-000168-index.htm",
            "accession_number": "0001467373-25-000168",
            "summary_points": [
                "1. Accenture plc's new bookings for Q3 FY25 were $19.7 billion, a decrease of 6% in U.S. dollars and 7% in local currency compared to Q3 FY24.",
                "2.  Accenture's diluted earnings per share for Q3 FY25 increased by 15% to $3.49 compared to $3.04 in Q3 FY24.",
                "3. As of June 20, 2025, Accenture expects full-year fiscal 2025 revenue growth to be 6% to 7% in local currency, with a positive 0.2% foreign exchange impact."
            ]
        },
        {
            "company_name": "Iron Mountain",
            "stock": "IRM",
            "wiki_url": "https://en.wikipedia.org/wiki/Iron_Mountain_(company)",
            "change_percent": -0.16,
            "price": 102.66,
            "filing_type": "8-K",
            "filing_time": "2025-06-20T06:33:35-04:00",
            "filing_url": "https://www.sec.gov/Archives/edgar/data/1020569/000102056925000150/0001020569-25-000150-index.htm",
            "accession_number": "0001020569-25-000150",
            "summary_points": [
                "1. As of June 20, 2025, Iron Mountain Incorporated faces a potential $500,000,000 loan default due to failure to obtain necessary legal opinions and a solvency certificate by the deadline.",
                "2.  The company increased its outstanding borrowings under the 2022 Term A Loans to $500,000,000 on June 18, 2025.",
                "3. The amended credit agreement mandates quarterly principal payments of 1.25% of the aggregate principal amount, starting June 18, 2025."
            ]
        }
    ]
}